Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedBarLoad.CSCode Property
 The CS code of the decomposed bar load.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisDecomposedLoad.LoadCoordinateEnum CSCode { get; }
Public ReadOnly Property CSCode As AnalysisDecomposedLoad.LoadCoordinateEnum
	Get
Property Value
Type: AnalysisDecomposedLoad.LoadCoordinateEnum
See Also
Reference
AnalysisDecomposedBarLoad Class
Tekla.Structures.Analysis Namespace